{
    "name": "章玥辰",
    "about": "关于我",
    "aboutHead": "关于我",
    "project": "项目经历",
    "projectHead": "项目经历",
    "education": "学业背景",
    "educationHead": "学业背景",
    "experience": "工作经验",
    "experienceHead": "工作经验",
    "resume": "个人简历",
    "contact": "联系方式",
    "contactHead": "联系方式",
    "aboutIntro": "大家好，欢迎访问我的个人网站。我叫章玥辰，你也可以叫我Joe。",
    "aboutCurStat": "我现在是一名在读留学生，就读于加拿大的滑铁卢大学。我的专业是计算机系的数据科学，并将毕业于2022年12月。",
    "aboutExp": "在学校，我们每学期会花4个月的时间学习知识，并在之后的4个月加入公司实习。因此目前为止，我已经有超过1年的实习经验了。在这种学习+实习的环境下，我的专业能力飞速提升，实践经验包括：计算机科学，软件工程，数据科学，机器学习，数据库管理等领域。",
    "aboutSkill": "在校，我的成绩优异，基础知识扎实。工作中，我思维活跃，适应能力强，可快速学习新知识，熟悉业务逻辑，在之前的工作经验中都获得同事的认可。对 C, C++, JavaScript, TypeScript, Angular, React, R, Python, TensorFlow, SQL, NoSQL, Git 等语言与技术我都十分熟悉。",
    "exp_kpmg": {
        "company": "毕马威",
        "position": "数据科学实习",
        "duration": "2022.01 - 今",
        "location": "多伦多，加拿大",
        "detail": [
            "项目运用NLP等文本识别算法提取监管文件中的信息，对监管规定进行信息提取、分类、数据统计等分析。便利立法人员，经济学家对文件的查阅、根据统计数据做出决策。",
            "主要负责的任务有：前端页面重构，根据客服需求开发功能和页面，检测并修复BUG，从数据库拉去数据。",
            "使用JavaScript, TypeScript, Angular, Express, NPM等技术开发，能力显著提升。"
        ]
    },
    "exp_highhope": {
        "company": "汇鸿汇升",
        "position": "数据分析，数据库管理",
        "duration": "2021.05 - 2021.07",
        "location": "江苏南京",
        "detail": [
            "The team mainly focused on maintaining financial data purchased from financial data vendors, updating daily price data to the company's database, and make sure the data is cossistent across databases.",
            "I also support other teams such as the production and the operation team by querying data, monitoring data updates, and producing financial reports.",
            "Maintained data integrity over 3 databases with over 100 tables. Investigated and cleaned over 1 million mis-recorded and inconsistent records from these databases.",
            "Developed and maintained programs that parses daily hedge fund net asset values from email bodies, and load the data into the databases",
            "Mainly programming the scripts with Python and SQL. Gained practical knowledge in database management."
        ]
    }
}                                                          